---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MissingLapInSketch
source: html/0e9db16d-4d11-4554-28c2-79602b28c27d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MissingLapInSketch Property

Rebar Sketch does not have lapped lengths. A circular shaped Rebar needs overlapping legths. Please overlap one of the ends of the circular Rebar Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId MissingLapInSketch { get; }
```